Assemcorp/PY32F072_Keil_Template/Drivers/PY32F072C_HAL_Driver/Src/py32f072c_hal_can.c
        /* The PTB is transmitting data, Cannot write data to PTB FIFO */
        return HAL_ERROR;
      }
    }
    else
    {
      /* select STB FIFO */
      SET_BIT(hcan->Instance->MCR, CAN_MCR_TBSEL);

      /* check that the STB FIFO is not full */
      if (__HAL_CAN_GET_STB_FIFO_FREE_LEVEL(hcan) != CAN_STB_FIFO_FULL)
      {
        /* Write data to the FIFO */
        CAN_CopyMessageToFifo(hcan, pTxHeader, pData);
        
        /* this slot has been filled, CAN-CTRL connects the TBUF registers to the next slot.*/
        SET_BIT(hcan->Instance->MCR, CAN_MCR_TSNEXT);
      }
      else
      {
        /* Update error code */
        hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

        /* The STB FIFO is full and cannot be written */
        return HAL_ERROR;
      }
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Activation the message is sent from Tx FIFO to the bus
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  activeTxMode Select the sending mode
  *         This parameter can be a value of @arg CAN_transmit_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ActivateTxRequest(CAN_HandleTypeDef *hcan, uint32_t activeTxMode)
{
  /* Check function parameters */
  assert_param(IS_CAN_TRANSMIT_MODE(activeTxMode));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (activeTxMode == CAN_TXFIFO_PTB_SEND)
    {
      /* PTB FIFO data start sending */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TPE);
    }

    if (activeTxMode == CAN_TXFIFO_STB_SEND_ONE)
    {
      /* Transmit STB FIFO one frame */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSONE);

      hcan->LastSTBTxType = CAN_TXFIFO_STB_SEND_ONE;
    }
    else if (activeTxMode == CAN_TXFIFO_STB_SEND_ALL)
    {
      /* Transmit STB FIFO all frame */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSALL);

      hcan->LastSTBTxType = CAN_TXFIFO_STB_SEND_ALL;
    }

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Get Tx FIFO message
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pRxHeader pointer to an CAN_RxHeaderTypeDef structure.
  * @param  pRxData pointer to a buffer containing the payload of the Rx frame.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_GetRxMessage(CAN_HandleTypeDef *hcan, CAN_RxHeaderTypeDef *pRxHeader, uint8_t *pRxData)
{
  uint8_t  *pData;
  uint32_t ByteCounter;
  uint32_t Format;
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (__HAL_CAN_GET_RX_FIFO_FILL_LEVEL(hcan) == CAN_RX_FIFO_EMPTY)
    {
      /* Update error code */
      hcan->ErrorCode |= HAL_CAN_ERROR_FIFO_FULL;

      return HAL_ERROR;
    }

    Format = hcan->Instance->RBUF.FORMAT;
    pRxHeader->DataLength = Format & CAN_LLC_FORMAT_DLC;
    pRxHeader->IdType = Format & CAN_LLC_FORMAT_IDE;
    pRxHeader->RxFrameType = Format & CAN_LLC_FORMAT_RMF;
    pRxHeader->FrameFormat = Format & CAN_LLC_FORMAT_FDF;
    pRxHeader->ProtocolErrorType = (Format & CAN_LLC_FORMAT_KOER)>>CAN_LLC_FORMAT_KOER_Pos;
    pRxHeader->LoopBackIndicator = Format & CAN_LLC_FORMAT_LBF;

    if (pRxHeader->IdType == CAN_EXTENDED_ID)
    {
      pRxHeader->Identifier = hcan->Instance->RBUF.ID & CAN_LLC_EXTENDED_ID_MSK;
    }
    else
    {
      pRxHeader->Identifier = (hcan->Instance->RBUF.ID & CAN_LLC_STANDARD_ID_MSK) >> 18;
    }
    
    /* Retrieve Rx payload */
    pData = (uint8_t *)hcan->Instance->RBUF.DATA;
    for (ByteCounter = 0; ByteCounter < DLCtoBytes[pRxHeader->DataLength]; ByteCounter++)
    {
      pRxData[ByteCounter] = pData[ByteCounter];
    }
    
    /* The host controller has read the actual RB slot and releases it. Afterwards CAN-CTRL points
          to the next RB slot.*/
    SET_BIT(hcan->Instance->MCR, CAN_MCR_RREL);
    
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Abort the message is sent from Tx FIFO to the bus
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  TransmitType Select a send mode to abort
  *         This parameter can be a value of @arg CAN_transmit_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_AbortTxRequest(CAN_HandleTypeDef *hcan, uint32_t TransmitType)
{
  /* Check function parameters */
  assert_param(IS_CAN_TRANSMIT_MODE(TransmitType));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    if (TransmitType == CAN_TXFIFO_PTB_SEND)
    {
      /* Abort PTB FIFO data transmission */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TPA);
    }

    if ((TransmitType == CAN_TXFIFO_STB_SEND_ONE) || (TransmitType == CAN_TXFIFO_STB_SEND_ALL))
    {
      /* Abort STB FIFO data transmission */
      SET_BIT(hcan->Instance->MCR,CAN_MCR_TSA);
    }

    hcan->LastAbortTxType = TransmitType;

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config CAN Re-arbitration limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  reaLimit indicates Re-arbitration limit value.
  *         This parameter can be a value of @arg CAN_rearbitration_Limit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRearbitrationLimit(CAN_HandleTypeDef *hcan, uint32_t reaLimit)
{
  /* Check function parameters */
  assert_param(IS_CAN_REARBITRATION_LIMIT(reaLimit));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {

    MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_REALIM, reaLimit);

    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config CAN Re-transmission limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  retLimit indicates Re-transmission limit value.
  *         This parameter can be a value of @arg CAN_retransmission_Limit.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRetransmissionLimit(CAN_HandleTypeDef *hcan, uint32_t retLimit)
{
  /* Check function parameters */
  assert_param(IS_CAN_RETRANSMISSION_LIMIT(retLimit));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->RLSSP, CAN_RLSSP_RETLIM, retLimit);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Config the Priority mode of STB Buffer transmit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  StbPriority the Priority mode of STB Buffer transmit.
  *         This parameter can be a value of @arg CAN_STB_Priority_Mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigTxFifoPriority(CAN_HandleTypeDef *hcan, uint32_t StbPriority)
{
  /* Check function parameters */
  assert_param(IS_CAN_STB_PRIORITY(StbPriority));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_TSMODE, StbPriority);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Configure the STB FIFO operation mode.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  OverflowMode CAN Receive Buffer Overflow Mode.
  *         This parameter can be a value of @arg CAN_RX_FIFO_overflow_mode.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoOverwrite(CAN_HandleTypeDef *hcan, uint32_t OverflowMode)
{
  /* Check function parameters */
  assert_param(IS_CAN_RX_FIFO_MODE(OverflowMode));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_ROM, OverflowMode);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Configure receive buffer almost full warning limit.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  Threshold receive buffer almost full warning limit.
  *         This parameter can be a value of @arg CAN_RX_FIFO_threshold.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_ConfigRxFifoThreshold(CAN_HandleTypeDef *hcan, uint32_t Threshold)
{
  /* Check function parameters */
  assert_param(IS_CAN_RX_FIFO_THRESHOLD(Threshold));

  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->WECR, CAN_WECR_AFWL, Threshold);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_EnableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    /* Enable transmitter delay compensation */
    SET_BIT(hcan->Instance->MCR, CAN_MCR_RBALL);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Disable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_DisableReceiveErrorDataFrame(CAN_HandleTypeDef *hcan)
{
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    /* Enable transmitter delay compensation */
    CLEAR_BIT(hcan->Instance->MCR, CAN_MCR_RBALL);

    /* Return function status */
    return HAL_OK;
  }
  else
  {
    /* Update error code */
    hcan->ErrorCode |= HAL_CAN_ERROR_NOT_STARTED;

    return HAL_ERROR;
  }
}

/**
  * @brief  Enable CAN receive error data frame.
  * @param  hcan pointer to an CAN_HandleTypeDef structure that contains
  *         the configuration information for the specified CAN.
  * @param  pTTConfig pointer to an CAN_TimeTriggerTypeDef structure.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CAN_TT_Config(CAN_HandleTypeDef *hcan, CAN_TimeTriggerTypeDef *pTTConfig)
{
  /* Check function parameters */
  assert_param(IS_CAN_TT_FIFO_MODE(pTTConfig->FifoMode));
  assert_param(IS_CAN_TT_PRESCALER(pTTConfig->Prescaler));
  if (pTTConfig->RefMessageIdType == CAN_STANDARD_ID)
  {
    assert_param(IS_CAN_MAX_VALUE(pTTConfig->RefMessageId, 0x7FFU));
  }
  else /* pTxHeader->IdType == CAN_EXTENDED_ID */
  {
    assert_param(IS_CAN_MAX_VALUE(pTTConfig->RefMessageId, 0x1FFFFFFFU));
  }
  assert_param(IS_CAN_TX_ENABLE_WINDOW(pTTConfig->TxEnableWindow));
  assert_param(IS_CAN_WATCH_TRIG_TIME(pTTConfig->WatchTrigTime));
  
  if (hcan->State == HAL_CAN_STATE_BUSY)
  {
    MODIFY_REG(hcan->Instance->MCR, CAN_MCR_TTTBM, pTTConfig->FifoMode);

